dtbinh/3rdYearsProject/Module6-7/Embeded/Project/DEMO_BITWISE/PIC24_DEMO_BITWISE.c
/*
*************************** C SOURCE FILE ************************************

project   :
filename  : PIC24_DEMO_BITWISE.C
version   : 2
date      :

******************************************************************************

Copyright (c) 20xx
All rights reserved.

******************************************************************************

VERSION HISTORY:
----------------------------
Version      : 1
Date         :
Revised by   :
Description  :

Version      : 2
Date         :
Revised by   :
Description  : *
               *
               *

******************************************************************************
*/

#define PIC24_DEMO_BITWISE_C_SRC

/****************************************************************************/
/**                                                                        **/
/**                             MODULES USED                               **/
/**                                                                        **/
/****************************************************************************/

#include "PIC24_DEMO_BITWISE.H"


/****************************************************************************/
/**                                                                        **/
/**                        DEFINITIONS AND MACROS                          **/
/**                                                                        **/
/****************************************************************************/


/****************************************************************************/
/**                                                                        **/
/**                        TYPEDEFS AND STRUCTURES                         **/
/**                                                                        **/
/****************************************************************************/


/****************************************************************************/
/**                                                                        **/
/**                      PROTOTYPES OF LOCAL FUNCTIONS                     **/
/**                                                                        **/
/****************************************************************************/

static void HardwareInit(void);

/****************************************************************************/
/**                                                                        **/
/**                           EXPORTED VARIABLES                           **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                            GLOBAL VARIABLES                            **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                           EXPORTED FUNCTIONS                           **/
/**                                                                        **/
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                             LOCAL FUNCTIONS                            **/
/**                                                                        **/
/****************************************************************************/

int main(void)
{
	int16u ip, op;
		HardwareInit();
		op = 0;
		for(;;)
		{
			ip = input_b();
			if((BitTestP(&ip,0)==1)&&(BitTestP(&ip,1)==1)&&(BitTestP(&ip,2)==1))
			{
				BitSetP(&op,0);
			}
			else
			{
				BitClearP(&op,0);
			}
			if((BitTest(ip,3)==0)&&(BitTest(ip,4)==0)&&(BitTest(ip,5)==0))
			{
				op = BitSet(op,1);
			}
			else
			{
				op = BitClear(op,1);
			}			
			if((BitTest(ip,6)==1)||(BitTest(ip,7)==1))
			{
				op = BitSet(op,2);
			}
			else
			{
				op = BitClear(op,2);
			}
			if(BitTest(ip,8)== BitTest(ip,9))
			{
				op = BitSet(op,3);
			}
			else
			{
				op = BitClear(op,3);
			}	
			if(BitTest(ip,10)!= BitTest(ip,11))
			{
				op = BitSet(op,4);
			}
			else
			{
				op = BitClear(op,4);
			}
			output_a(op);		
		}
		return 0;
}

static void HardwareInit(void)
{
	setup_adc_ports(NO_ANALOGS);
	set_tris_a(get_tris_a() & 0xffe0);
	set_tris_b(get_tris_b() | 0x0fff);
	output_a(0);
	return;
}	
/****************************************************************************/

/****************************************************************************/
/**                                                                        **/
/**                                 EOF                                    **/
/**                                                                        **/
/****************************************************************************/